#+title: Sprint Backlog 01
#+options: date:nil toc:nil author:nil num:nil
#+todo: STARTED | COMPLETED CANCELLED POSTPONED
#+tags: { story(s) spike(p) }

* Mission

- Provide a full layman's explanation the LIF model.

* Stories

** Active

#+begin: clocktable :maxlevel 3 :scope subtree :indent nil :emphasize nil :scope file :narrow 75
#+CAPTION: Clock summary at [2015-09-14 Mon 16:51]
| <75>                                                                        |         |       |      |
| Headline                                                                    | Time    |       |      |
|-----------------------------------------------------------------------------+---------+-------+------|
| *Total time*                                                                | *22:20* |       |      |
|-----------------------------------------------------------------------------+---------+-------+------|
| Stories                                                                     | 22:20   |       |      |
| Active                                                                      |         | 22:20 |      |
| STARTED Sprint and product backlog grooming                                 |         |       | 0:14 |
| COMPLETED Write post on C++ implementation of Ohm's Law                     |         |       | 0:40 |
| COMPLETED Write a post on Capacitors and RC Circuits                        |         |       | 3:59 |
| COMPLETED Write a post on more advanced neuron morphology                   |         |       | 3:00 |
| STARTED Implement LIF and blog about it                                     |         |       | 9:27 |
| STARTED Watch lectures on neuroscience                                      |         |       | 5:00 |
#+end:

*** COMPLETED Sprint and product backlog grooming                     :story:
    CLOSED: [2015-10-19 Mon 16:37]
    CLOCK: [2015-09-03 Thu 07:51]--[2015-09-03 Thu 08:05] =>  0:14

Updates to sprint and product backlog.

*** COMPLETED Write post on C++ implementation of Ohm's Law           :story:
    CLOSED: [2015-09-05 Sat 18:48]
    CLOCK: [2015-09-03 Thu 08:05]--[2015-09-03 Thu 08:45] =>  0:40

Create a simple post describing the code for Ohm's Law.

*** COMPLETED Write a post on Capacitors and RC Circuits              :story:
    CLOSED: [2015-09-05 Sat 18:48]
    CLOCK: [2015-09-05 Sat 15:01]--[2015-09-05 Sat 19:00] =>  3:59

Finish up the post on RC Circuits, with possibly a link back to
neurons.

*** COMPLETED Write a post on more advanced neuron morphology         :story:
    CLOSED: [2015-09-08 Tue 18:16]
    CLOCK: [2015-09-05 Sat 20:48]--[2015-09-05 Sat 22:49] =>  2:01
    CLOCK: [2015-09-05 Sat 19:06]--[2015-09-05 Sat 20:05] =>  0:59

We need to start talking about:

- concentration gradient, voltage
- ions: channels and pumps

*** COMPLETED Implement LIF and blog about it                         :story:
    CLOSED: [2015-10-19 Mon 16:37]
    CLOCK: [2015-09-10 Thu 19:10]--[2015-09-10 Thu 20:00] =>  0:50
    CLOCK: [2015-09-10 Thu 07:51]--[2015-09-10 Thu 08:40] =>  0:49
    CLOCK: [2015-09-09 Wed 13:47]--[2015-09-09 Wed 18:20] =>  4:33
    CLOCK: [2015-09-08 Tue 15:01]--[2015-09-08 Tue 18:16] =>  3:15

We need to use odeint. We need to write a blog post describing it.

*** COMPLETED Watch lectures on neuroscience
    CLOSED: [2015-10-19 Mon 16:37]
    CLOCK: [2015-09-12 Sat 14:00]--[2015-09-12 Sat 19:00] =>  5:00

We should take advantage of downtime to watch lectures on neuroscience.

*** CANCELLED Consider writing a post about other neuron features
    CLOSED: [2015-10-19 Mon 16:37]

- high-level: mylin sheath, axon hillock, etc.
- lower level: compartments

Links:

- [[http://mathneuronet.org.uk/training/single_cell_notes.pdf][Single neuron models]]
